Repository: 84000/data-translation-memory
Catalog: Toh_147-The_Teaching_on_the_Great_Compassion_of_the_Tathagata-v1.tmx
Source language: bo
Languages: en

source: དེ་ནི་ཇི་ལྟར་མཉམ་བཞག་དེ་ལྟར་འགྲོ་བ་ལ། །རྟག་ཏུ་ཆོས་རྣམས་སྟོན་ཏེ་
en: Just as they are in equipoise, so do they continuously teach the dharmas to beings.

source: འདི་ནི་རྒྱལ་བའི་ལས། །
en: That is the activity of the victors.’

source: རིགས་ཀྱི་བུ་གཞན་ཡང་ཐ་དད་པའི་འདུ་ཤེས་གང་གིས་སེམས་མི་མཉམ་པར་གནས་པར་འགྱུར་བའི་ཐ་དད་པའི་འདུ་ཤེས་དེ་བཞིན་གཤེགས་པ་ལ་མེད་དོ། །
en: (19) “Son of noble family, the tathāgatas are free from perceptions of difference of the type that would lead the mind into a state of imbalance.

source: ནམ་མཁའ་བཞིན་དུ་ཞིང་མི་ཟད་པའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ཞིང་རྣམས་ལ་ཐ་དད་པའི་འདུ་ཤེས་མེད་དོ། །
en: The tathāgatas are free from perceptions of difference regarding the fields, since the fields are inexhaustible like space;

source: རང་བཞིན་གྱིས་བདག་མེད་པའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་སེམས་ཅན་རྣམས་ལ་ཐ་དད་པའི་འདུ་ཤེས་མེད་དོ། །
en: they are free from perceptions of difference regarding sentient beings, since they are by nature without a self;

source: ཆོས་ཀྱི་དབྱིངས་འདྲེས་པ་མེད་ཅིང་མཉམ་པ་ཉིད་དུ་ཤེས་པའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་སངས་རྒྱས་ཀྱི་ཞིང་རྣམས་ལ་ཐ་དད་པའི་འདུ་ཤེས་མེད་དོ། །
en: they are free from perceptions of difference regarding the buddhafields, since they know the realm of phenomena to be a state of unadulterated equality;

source: འདོད་ཆགས་དང་བྲལ་བའི་ཆོས་ཉིད་ཀྱི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ཆོས་རྣམས་ལ་ཐ་དད་པའི་འདུ་ཤེས་མེད་དོ། །
en: and they are free from perceptions of difference regarding phenomena, since the nature of reality is free from attachment.

source: དེ་བཞིན་གཤེགས་པ་ནི་ཚུལ་ཁྲིམས་དང་ལྡན་པ་རྣམས་ལ་ཡང་རྗེས་སུ་ཆགས་པ་མེད། ཚུལ་ཁྲིམས་འཆལ་པ་རྣམས་ལ་ཡང་ཁོང་ཁྲོ་བ་མེད།
en: “Tathāgatas do not favor those who observe moral conduct or feel anger toward those who transgress moral conduct.

source: ཕན་བཏགས་པ་རྣམས་ལ་ཡང་ལན་དུ་ཕན་འདོགས་པ་མེད། གནོད་པ་བྱས་པ་རྣམས་ལ་ཡང་ལན་དུ་གནོད་པ་བྱེད་པ་མེད།
en: They do not reward those who do good or return harm to those who have done harm.

source: འདུལ་བར་འོས་པ་རྣམས་ལ་ཡང་མཉམ་པ་ཉིད་དུ་མ་ཡིན། ལོག་པར་ངེས་པ་རྣམས་ལ་ཡང་སྨོད་པ་མ་ཡིན་གྱི།
en: They are not indifferent to those who are worthy of training, nor do they condemn those who are stuck in error.

source: དེ་བཞིན་གཤེགས་པ་ནི་ཆོས་ཐམས་ཅད་ལ་མཉམ་པ་ཉིད་དུ་གནས་པ་སྟེ།
en: The tathāgatas abide in sameness regarding all phenomena.

source: དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ལ་ཐ་དད་པའི་འདུ་ཤེས་མེད་ཅེས་བྱའོ། །
en: Therefore, the tathāgatas are said to be without any perceptions of difference.

source: ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་ལ་ཐ་དད་པའི་འདུ་ཤེས་མེད་པ་དེ་ལྟར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཐ་དད་པའི་འདུ་ཤེས་སྤང་བའི་ཕྱིར་ཆོས་སྟོན་ཏེ།
en: “Just as the tathāgatas are free of perceptions of difference, they teach the Dharma accordingly in order that all sentient beings may abandon perceptions of difference.

source: འདི་ནི་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པའི་འཕྲིན་ལས་བཅུ་དགུ་པའོ། །
en: This is the nineteenth tathāgata activity of the tathāgatas.

source: ཞིང་དང་སེམས་ཅན་དེ་བཞིན་ཆོས་རྣམས་ལ། །ཐ་དད་འདུ་ཤེས་བདེ་བར་གཤེགས་པ་མེད། །
en: “ ‘The sugatas are free of perceptions of difference Regarding fields, sentient beings, or phenomena.

source: མཉམ་ཉིད་གནས་ཤིང་གྲགས་པ་ཆེ་རྣམས་ལ། །ཐ་དད་འདུ་ཤེས་ནམ་ཡང་ཡོད་མ་ཡིན། །
en: Because they abide in sameness, The greatly renowned never have perceptions of difference.

source: ཁྲིམས་ལྡན་ཁ་ན་མ་ཐོ་མེད་པའི་ཁྲིམས། །སེམས་ཅན་འདུལ་བའི་འོས་དང་གདུལ་དཀའ་བ། །དེ་ལ་རྐང་གཉིས་དམ་པ་སེམས་མཉམ་སྟེ། །
en: “ ‘The minds of superior humans are the same Whether beings observe moral conduct or faultless conduct, Or whether they are ready to be tamed or difficult to tame.

source: སེམས་ཅན་ཐ་དད་འཛིན་པ་ཐར་བར་བྱེད། །
en: They liberate those who apprehend difference.’

source: རིགས་ཀྱི་བུ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་ལ་སོ་སོར་མ་བརྟགས་པའི་བཏང་སྙོམས་མེད་དོ། །
en: (20) “Son of noble family, the equanimity of the tathāgatas is not due to a lack of discernment.

source: དེ་བཞིན་གཤེགས་པའི་བཏང་སྙོམས་ནི་ལམ་བསྒོམས་པ་ཡིན་གྱི། ལམ་མ་བསྒོམས་པ་མ་ཡིན་ཏེ།
en: Because the equanimity of the tathāgatas comprises cultivation of the path, not a lack of its cultivation.

source: ལུས་བསྒོམས་པ། སེམས་བསྒོམས་པ། ཚུལ་ཁྲིམས་བསྒོམས་པའོ། །
en: It is the cultivation of body, mind, and moral conduct.

source: དེ་བཞིན་གཤེགས་པའི་བཏང་སྙོམས་ནི་ཤེས་རབ་བསྒོམས་པ་ཡིན་གྱི། མ་བསྒོམས་པ་མ་ཡིན་ནོ། །
en: The equanimity of the tathāgatas comprises the cultivation of insight, not a lack of its cultivation.

source: དེ་བཞིན་གཤེགས་པའི་བཏང་སྙོམས་ནི་ཡེ་ཤེས་དང་ལྡན་པ་ཡིན་གྱི། གཏི་མུག་དང་ལྡན་པ་མ་ཡིན་ནོ། །དེ་བཞིན་གཤེགས་པའི་བཏང་སྙོམས་ནི་འཇིག་རྟེན་ལས་འདས་པ་ཡིན་གྱི། འཇིག་རྟེན་པར་ལྟུང་བ་མ་ཡིན་ནོ། །
en: It is endowed with insight, not with delusion. It transcends the world; it does not descend into the mundane.

source: དེ་བཞིན་གཤེགས་པའི་བཏང་སྙོམས་ནི་འཕགས་པ་ངེས་པར་འབྱུང་བ་ཡིན་གྱི། འཕགས་པ་མ་ཡིན་པ་ངེས་པར་མི་འབྱུང་བ་མ་ཡིན་ནོ། །
en: It constitutes the deliverance of a noble one, not the nondeliverance of someone who is not a noble one.

source: དེ་བཞིན་གཤེགས་པའི་བཏང་སྙོམས་ནི་ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་བ་སྟེ། སེམས་ཅན་ལ་སྙིང་རྗེ་ཆེན་པོ་དང་བྲལ་བ་མ་ཡིན་ནོ། །
en: “The equanimity of tathāgatas involves turning the wheel of the Dharma. It is not without great compassion for beings.

source: དེ་བཞིན་གཤེགས་པའི་བཏང་སྙོམས་དེ་ནི་རང་གི་ཚུལ་གྱིས་སྒྲུབ་པ་སྟེ་གཉེན་པོའི་རྗེས་སུ་སོང་བ་མ་ཡིན།
en: It is realized of its own accord without relying on a remedy.

source: མཐོ་བར་སེམས་པ་མ་ཡིན། དམའ་བར་སེམས་པ་མ་ཡིན་ཏེ།
en: It is not an elated state of mind or a depressed state of mind.

source: གནས་པ་མི་གཡོ་བར་གྱུར་པ། དམིགས་པ་དང་བྲལ་བ།
en: It is an unwavering state without objectification.

source: རྟོག་པ་དང་སེལ་བ་ལས་ཤིན་ཏུ་འདས་པ།
en: It transcends conceptualization and conceptual exclusion.

source: དུས་ལ་ལྟ་བ། དུས་ལས་མ་ཡོལ་བ།
en: It is aware of the occasion and timely.

source: མི་གཡོ་བ། མི་སེམས་པ། མི་རྟོག་པ། རྣམ་པར་མི་རྟོག་པ། རྣམ་པར་མ་བསྒྲུབས་པ། བསྟན་དུ་མེད་པ། ཡང་དག་པ། དེ་ཁོ་ན།
en: It does not waver. It is not intentional, discriminative, or analytical. It is not an accomplishment. It is indefinable. It is genuine.

source: དེ་བཞིན་ཉིད། གཞན་མ་ཡིན་པ་དེ་བཞིན་ཉིད་དེ།
en: It is just that: suchness—unique suchness.

source: དེ་བཞིན་གཤེགས་པ་ནི་བཏང་སྙོམས་ཆེན་པོ་དེ་ལྟ་བུ་ཕུན་སུམ་ཚོགས་པས་སེམས་ཅན་ཐམས་ཅད་ལ་བཏང་སྙོམས་དེ་ལྟ་བུ་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏེ།
en: “Through the perfection of such great equanimity the tathāgatas teach the Dharma accordingly, so that all sentient beings may perfect such equanimity.

source: འདི་ནི་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པའི་འཕྲིན་ལས་ཉི་ཤུ་པའོ། །
en: This is the twentieth tathāgata activity of the tathāgatas.

source: ལེགས་སྤྱད་ལམ་མཆོག་ཤིན་ཏུ་བསྒོམས་པའི་ཕྱིར། །
en: “ ‘Since the supreme path of excellent conduct has been cultivated,

source: སོ་སོར་མ་བརྟགས་བཏང་སྙོམས་ཡོད་མ་ཡིན། །
en: Their equanimity is not due to lack of discernment.

source: གང་ཟག་མཆོག་ནི་ལུས་དང་དེ་བཞིན་སེམས། །ཚུལ་ཁྲིམས་ཤེས་རབ་བདེན་པ་ཤིན་ཏུ་བསྒོམས། །
en: The supreme beings fully cultivated body, mind, Moral conduct, insight, and truth.

source: རྒྱལ་བ་རྗེས་སུ་ཆགས་དང་ཁོང་ཁྲོ་མེད། །
en: “ ‘The victors lack attachment or anger.

source: རྟོག་དང་རྣམ་པར་རྟོག་དང་རྣམ་བསྒྲུབས་མེད། །
en: Without discrimination, analysis, or accomplishment,

source: བཏང་སྙོམས་ཡང་དག་དེ་བཞིན་གཞན་མ་ཡིན། །
en: Their equanimity is genuine and unique.

source: དེ་ལྟར་ཡིན་ཡང་འགྲོ་བ་ཀུན་ལ་འཆད། །
en: Still, they teach all beings.’

source: རིགས་ཀྱི་བུ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པའི་འདུན་པ་ཉམས་པ་མེད་དོ། །
en: (21) “Son of noble family, the zeal of the tathāgatas does not deteriorate.

source: དེ་ལ་འདུན་པ་གང་ཞེ་ན།
en: What kind of zeal is it?

source: འདི་ལྟ་སྟེ། དགེ་བའི་ཆོས་ལ་འདུན་པའོ། །
en: It is the zeal for virtuous factors.

source: དེ་ཡང་གང་ཞེ་ན།
en: Why is that?

source: བྱམས་པ་ཆེན་པོ་ལ་དེ་བཞིན་གཤེགས་པའི་འདུན་པ་ཉམས་པ་མེད་དོ། །སྙིང་རྗེ་ཆེན་པོ་ལ་དེ་བཞིན་གཤེགས་པའི་འདུན་པ་ཉམས་པ་མེད་དོ། །
en: The tathāgatas’ zeal for great love and great compassion does not deteriorate.

source: ཆོས་སྟོན་པ་ལ་འདུན་པ་ཉམས་པ་མེད་དོ། །སེམས་ཅན་འདུལ་བ་ལ་འདུན་པ་ཉམས་པ་མེད་དོ། །སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ལ་འདུན་པ་ཉམས་པ་མེད་དོ། །
en: Their zeal for teaching the Dharma and for taming and ripening beings does not deteriorate.

source: རབ་ཏུ་དབེན་པ་ལ་འདུན་པ་ཉམས་པ་མེད་དོ། །
en: Their zeal for solitude does not deteriorate.

source: སེམས་ཅན་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་འཇུག་པ་ལ་འདུན་པ་ཉམས་པ་མེད་དོ། །
en: Their zeal for engaging sentient beings in embracing awakening does not deteriorate.

source: དཀོན་མཆོག་གསུམ་གྱི་རིགས་རྒྱུན་མི་གཅོད་པ་ལ་འདུན་པ་ཉམས་པ་མེད་དོ། །
en: Their zeal for the unbroken continuity of the lineage of the Three Jewels does not deteriorate.

source: དེ་བཞིན་གཤེགས་པ་ནི་འདུན་པས་འགྲོ་བ་མ་ཡིན་གྱི། དེ་བཞིན་གཤེགས་པའི་འདུན་པ་ནི་ཡེ་ཤེས་སྔོན་དུ་འགྲོ་བ་ཉིད་དེ།
en: “The tathāgatas are not driven by zeal, but, rather, their zeal is preceded by wisdom.

source: དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པའི་འདུན་པ་ཉམས་པ་མེད་ཅེས་བྱའོ། །
en: That is why it is said that the zeal of the tathāgatas does not deteriorate.

source: སེམས་ཅན་ཐམས་ཅད་ལ་བླ་ན་མེད་པའི་འདུན་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་ཆོས་ཀྱང་སྟོན་ཏེ།
en: The tathāgatas teach the Dharma so that the unsurpassed zeal of all sentient beings may be perfected.

source: འདི་ནི་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པའི་འཕྲིན་ལས་ཉི་ཤུ་རྩ་གཅིག་པའོ། །
en: This is the twenty-first tathāgata activity of the tathāgatas.

source: རྒྱལ་བའི་འདུན་པ་རྟག་ཏུ་དགེ་བའི་ཆོས་ཀྱི་ཚུལ་ལ་འདོད་ཅིང་དགའ། །
en: “ ‘The zeal of the victors is a constant wish for and delight in virtuous factors.

source: སེམས་ཅན་རབ་ཏུ་ཐར་བར་བྱ་ཕྱིར་བྱམས་དང་སྙིང་རྗེའི་ཆོས་ཀྱང་སྦྱིན། །
en: They bestow the Dharma of love and compassion in order to liberate beings.

source: སེམས་ཅན་ཡོངས་སྨིན་བྱ་དང་ནགས་ཚལ་དགའ་ལ་མོས་པ་ཉམས་པ་མེད། །
en: Their longing to mature beings and to delight in forest groves does not deteriorate.

source: རབ་ཏུ་མང་པོ་བྱང་ཆུབ་འཛིན་འཇུག་དཀོན་མཆོག་གསུམ་གྱི་རྒྱུན་མི་གཅོད། །
en: They cause many to embrace awakening and do not disrupt the continuity of the lineage of the Three Jewels.

source: འདོད་དང་ཞེ་སྡང་དང་ནི་འཇིགས་དང་གཏི་མུག་གིས་ནི་འགྲོ་མ་ཡིན། །
en: “ ‘They are not driven by attachment, aversion, fear, or delusion.

source: ཁྱད་པར་གྱུར་ནས་མཁས་དེ་ཤེས་པས་བྱས་པའི་ཆོས་ཀུན་རྟོགས་པར་འགྱུར། །
en: Exceptionally skilled, they realize all factors that are produced by knowledge.

source: རྒྱལ་བ་སེམས་ཅན་འདུན་བྲལ་ལེ་ལོ་ཅན་དག་མཐོང་ནས་འདུན་ལ་སྦྱོར། །
en: Observing lazy beings who lack zeal, the victors motivate them.

source: གང་གིས་འགྲོ་བ་འདུན་པའི་ལས་ནི་མཚུངས་པ་མེད་པའི་ཤེས་པས་རིག །
en: With unequaled knowledge they understand the zealous actions of beings.’

source: རིགས་ཀྱི་བུ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པའི་བརྩོན་འགྲུས་ཉམས་པ་མེད་དོ། །
en: (22) “Son of noble family, the vigor of tathāgatas does not deteriorate.

source: དེ་ལ་དེ་བཞིན་གཤེགས་པའི་བརྩོན་འགྲུས་ནི་འདི་ཡིན་ཏེ།
en: The vigor of the tathāgatas is as follows:

source: འདི་ལྟ་སྟེ། འདུལ་བའི་སེམས་ཅན་རྣམས་ཡལ་བར་མི་འདོར་བའི་བརྩོན་འགྲུས་དང་། ཆོས་ཉན་པ་དག་ལ་བརྙས་པ་མེད་པའི་བརྩོན་འགྲུས་སོ། །
en: It is a vigor that does not forsake beings to be tamed or disdain those who listen to the Dharma.

source: གལ་ཏེ་དེ་བཞིན་གཤེགས་པས་ཆོས་ཀྱི་སྣོད་ཆོས་ཉན་པ་གང་བསྐལ་པར་ཡང་ཆོས་ཉན་པས་སྐྱོ་བར་མི་འགྱུར་བ་རྙེད་ན་དེ་བཞིན་གཤེགས་པ་ཡང་ཆོས་སྟོན། ཁ་ཟས་དང་བྲལ་བའི་རྒྱུད་དུ་གྱུར་ཀྱང་བསྐལ་པར་ཡང་མི་ལྡང་ངོ་། །
en: When the tathāgatas discover audiences receptive to the Dharma, who do not tire of listening to the Dharma even for an eon, the tathāgatas will teach the Dharma, uninterrupted by meals and without stirring, even for an eon.

source: དེ་བཞིན་གཤེགས་པ་ནི་སེམས་ཅན་ལ་ལྟ་བས་ཐ་ན་གང་ན་སངས་རྒྱས་ཀྱིས་འདུལ་བའི་སེམས་ཅན་གཅིག་གི་ཕྱིར་ཡང་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་འདའ་ཞིང་བཞུད་དེ།
en: For the sake of just a single being to be tamed by the buddhas, the tathāgatas, in their concern for beings, will travel beyond as many buddhafields as the number of grains of sand of the river Ganges.

source: དེ་བཞིན་གཤེགས་པ་ལ་སྐུ་མཉེལ་བའམ། གསུང་མཉེལ་བའམ། ཐུགས་མཉེལ་བ་མེད་དོ། །
en: They will not become physically, verbally, or mentally weary.

source: དེ་བཞིན་གཤེགས་པ་ནི་སེམས་ཤིན་ཏུ་སྦྱངས་པ། བརྩོན་འགྲུས་བརྩམས་པ། བརྩོན་འགྲུས་ཀྱི་བསྔགས་པ་སྨྲ་བ་སྟེ།
en: “The tathāgatas have made their minds pliant, roused vigor, and spoken in praise of vigor.

source: ཡང་དག་པར་སྦྱོར་བའི་བརྩོན་འགྲུས་གང་གིས་སེམས་ཅན་རྣམས་ཀྱིས་འཕགས་པའི་རྣམ་པར་གྲོལ་བ་ཐོབ་པར་འགྱུར་བའི་བརྩོན་འགྲུས་དེ་སེམས་ཅན་རྣམས་ལ་བསྔགས་པར་བྱེད་དེ།
en: The vigor through which sentient beings, by correctly applying themselves to it, will attain noble liberation—that is the vigor commended to them.

source: འདི་ནི་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པའི་འཕྲིན་ལས་ཉི་ཤུ་རྩ་གཉིས་པའོ། །
en: This is the twenty-second tathāgata activity of the tathāgatas.

source: བརྩོན་འགྲུས་གང་གིས་མི་ཡི་སེང་གེ་འཕགས་འགྱུར་བ། །
en: Through which the lions among humans became noble beings.

source: བརྩོན་འགྲུས་སྟོབས་དེའི་བསྔགས་པ་རྟག་ཏུ་རྗོད་པར་བྱེད། །
en: “ ‘They continually praise that powerful vigor

source: བརྩོན་འགྲུས་སྟོབས་ནི་གང་དུའང་ཉམས་པ་ཡོད་མིན་ཏེ། །
en: That powerful vigor does not deteriorate at all.

source: སྣོད་དུ་གྱུར་པ་རྙེད་ནས་ཆོས་ཀྱང་སྟོན་པར་བྱེད། །
en: Once an audience is found, the Dharma is taught.

source: བདེ་བར་གཤེགས་ཀྱི་བརྩོན་འགྲུས་གནས་པ་ཡོད་མིན་ཏེ། །
en: “ ‘The vigor of the sugatas never rests.

source: ལུས་དང་ངག་དང་སེམས་ནི་གང་དུའང་སྐྱོ་བ་མེད། །
en: It is without physical, verbal, or mental weariness.

source: ཇི་ལྟར་རང་བྱུང་བརྩོན་འགྲུས་ཀུན་དུ་སྡིག་མེད་པ། །
en: Just as this spontaneous vigor is completely free of sin,

source: དེ་ལྟར་བློ་སྦྱངས་སེམས་ཅན་ཡང་དག་འཛིན་དུ་འཇུག །
en: So are beings, having purified their minds, stablished in it.’

source: རིགས་ཀྱི་བུ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པའི་དྲན་པ་ནི་ཐམས་ཅད་ཀྱི་ཐམས་ཅད་རྣམ་པ་ཐམས་ཅད་ཀྱི་ཐམས་ཅད་དུ་ཉམས་པ་མེད་དོ། །
en: (23) “Son of noble family, the mindfulness of tathāgatas does not deteriorate in any respect or in any way whatsoever.

source: དེ་བཞིན་གཤེགས་པ་ལ་བསྙེལ་བ་མེད་དོ། །
en: Because the tathāgatas are not forgetful.

source: རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་མ་ཐག་ཏུ་འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་སེམས་ཅན་རྣམས་ཀྱི་སེམས་ཀྱི་རྒྱུད་ལ་རྣམ་པར་གཟིགས་ཀྱང་དེ་ལ་དེ་བཞིན་གཤེགས་པ་བསྙེལ་བ་ཤིན་ཏུ་མེད་དོ། །
en: Son of noble family, as soon as tathāgatas awaken into unsurpassed, perfect awakening, they behold the mindstreams of all sentient beings of the past, present, and future. Still, they are not forgetful at all.

source: སེམས་ཅན་གྱི་སྤྱོད་པ་ཇི་ལྟ་བ་བཞིན་དུ་མཁྱེན་ཀྱང་དེ་ལ་དེ་བཞིན་གཤེགས་པས་ཡེ་ཤེས་ཡང་གཏོང་བ་མེད་དོ། །
en: Although they know the conduct of beings in accordance with reality, the tathāgatas do not let go of their wisdom regarding it.

source: དེ་བཞིན་གཤེགས་པ་ནི་ཕུང་པོ་གསུམ་དུ་རྣམ་པར་དགོད་པ་དང་། སེམས་ཅན་གྱི་དབང་པོ་ལ་འཇུག་པ་དང་། སེམས་ཅན་གྱི་བསམ་པ་ལ་འཇུག་པ་དང་། སེམས་ཅན་གྱི་སྤྱོད་པ་ལ་རྣམ་པར་གཟིགས་པས་དྲན་པ་ཉམས་པ་མེད་པ་ཉིད་དེ།
en: The mindfulness of tathāgatas does not deteriorate when they assign beings to three groups, engage with their faculties and mentalities, and behold their conduct.

source: དེ་བཞིན་གཤེགས་པ་ནི་དྲན་པར་བྱས་སམ། བསམས་སམ། རྣམ་པར་བརྟགས་ཏེ་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་པ་མེད་དོ། །
en: The tathāgatas’ teaching of the Dharma to beings happens without activating their recollection, without intention or analysis.

source: སྟོན་ཀྱང་ཉམས་པ་མེད་དོ། །
en: Even while teaching, their mindfulness does not deteriorate.

source: དེ་བཞིན་གཤེགས་པའི་དྲན་པ་ནི་ཇི་ལྟར་ཉམས་པ་མེད་དོ། །
en: Because the mindfulness of tathāgatas does not deteriorate.

source: དེ་ཇི་ལྟར་བདག་དྲན་ཞིང་བསྙེལ་བ་མེད་པ་དེ་ལྟར་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏེ།
en: Just as they are mindful and without forgetfulness, they teach the Dharma to beings accordingly.

source: འདི་ནི་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པའི་འཕྲིན་ལས་ཉི་ཤུ་རྩ་གསུམ་པའོ། །
en: This is the twenty-third tathāgata activity of the tathāgatas.

source: སྟོན་པའི་དྲན་པ་གང་ཡང་ཉམས་མེད་དེ། །
en: “ ‘The mindfulness of the teachers does not deteriorate in the slightest.

source: རྒྱལ་བའི་དྲན་པས་དྲན་པར་བྱ་བ་མེད། །
en: The mindfulness of the victors is effortless.

source: རྒྱལ་བས་གང་ཚེ་བྱང་ཆུབ་སངས་རྒྱས་ནས། །
en: When the victors awaken into awakening,

source: འགྲོ་བའི་སེམས་ནི་མ་ལུས་རྣམ་པར་མཁྱེན། །
en: They know the minds of all beings without exception.

source: བསམ་པ་དབང་པོ་སེམས་ཅན་སྤྱོད་པ་དང་། །ཕྱིས་ཡང་རྣམ་པར་ཤེས་པར་བྱ་བ་མེད། །
en: “ ‘The thoughts, faculties, and conduct of beings Are not to be cognized consequently.

source: ལྷུན་གྱིས་གྲུབ་པའི་བྱ་བར་གནས་ནས་ནི། །རྒྱལ་བའི་དབང་པོ་འགྲོ་ལ་ཆོས་སྟོན་ཏོ། །
en: Remaining in order to act spontaneously, The victorious lords teach beings the Dharma.’

source: རིགས་ཀྱི་བུ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་ཉམས་པ་མེད་དོ། །
en: (24) “Son of noble family, the meditative absorption of the tathāgatas does not deteriorate.

source: དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་གང་ཡིན་པ་དེ་ནི་ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་དང་ཆོས་ཐམས་ཅད་མི་མཉམ་པ་མ་ཡིན་པ་དང་། ཆོས་ཐམས་ཅད་ཇི་ལྟ་བ་བཞིན་ནོ། །
en: It is the sameness of all phenomena, the fact that all phenomena are not not the same, and all phenomena as they really are.

source: ཅིའི་ཕྱིར་དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་ཉམས་པར་མི་འགྱུར་ཞེ་ན།
en: Why does the meditative absorption of the tathāgatas not deteriorate?

source: དེ་བཞིན་ཉིད་གང་དང་མཉམ་པ་དེ་དང་ཏིང་ངེ་འཛིན་དང་མཉམ་མོ། །
en: What is equal to suchness is equal to absorption.

source: ཏིང་ངེ་འཛིན་གང་དང་མཉམ་པ་དེ་དང་དེ་བཞིན་གཤེགས་པ་མཉམ་སྟེ།
en: What is equal to absorption is equal to the tathāgatas.

source: དེའི་ཕྱིར་མཉམ་པར་གཞག་པ་ཞེས་བྱའོ། །
en: That is why it is called equipoise.

source: འདོད་ཆགས་ཀྱི་མཐའ་གང་དང་མཉམ་པ་འདོད་ཆགས་དང་བྲལ་བའི་མཐའ་ཡང་དེ་དང་མཉམ་མོ། །
en: “What is equal to the extreme of attachment is equal to the extreme of the lack of attachment.

source: ཞེ་སྡང་གི་མཐའ་གང་དང་མཉམ་པ་ཞེ་སྡང་དང་བྲལ་བའི་མཐའ་ཡང་དེ་དང་མཉམ་མོ། །
en: What is equal to the extreme of aversion is equal to the extreme of the lack of aversion.

source: གཏི་མུག་གི་མཐའ་གང་དང་མཉམ་པ་གཏི་མུག་དང་བྲལ་བའི་མཐའ་ཡང་དེ་དང་མཉམ་མོ། །
en: What is equal to the extreme of delusion is equal to the extreme of the lack of delusion.

source: འདུས་བྱས་ཀྱི་མཐའ་གང་དང་མཉམ་པ་འདུས་མ་བྱས་ཀྱི་མཐའ་ཡང་དེ་དང་མཉམ་མོ། །
en: What is equal to the extreme of the conditioned is equal to the extreme of the unconditioned.

source: འཁོར་བའི་མཐའ་གང་དང་མཉམ་པ་མྱ་ངན་ལས་འདས་པའི་མཐའ་ཡང་དེ་དང་མཉམ་སྟེ།
en: What is equal to the extreme of saṃsāra is equal to the extreme of nirvāṇa.

source: མཉམ་པ་ཉིད་དེ་དག་ལ་སྙོམས་པར་ཞུགས་པས་དེའི་ཕྱིར་མཉམ་པར་གཞག་པ་ཞེས་བྱའོ། །
en: Having settled evenly in these types of sameness is called equipoise.

source: དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་ཉམས་པ་མེད་ཅེས་བྱའོ། །
en: Because the absorption of the tathāgatas is without deterioration.

source: མཉམ་པ་ཉིད་དེ་ལ་ཉམས་པ་མེད།
en: Because there is no deterioration in that sameness.

source: ཡོངས་སུ་ཉམས་པ་མེད་དོ། །
en: There is no deterioration at all.

source: དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་དེ་ཡང་མིག་དང་ལྡན་པ་མ་ཡིན། རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་དང་ལྡན་པ་མ་ཡིན་མོད་ཀྱི། དེ་བཞིན་གཤེགས་པ་དབང་པོ་མ་ཚང་བ་ཡང་མ་ཡིན་ནོ། །
en: “The absorption of the tathāgatas does not involve the eyes, ear, nose, tongue, body, or mind, even though the tathāgatas have complete faculties.

source: དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་ནི་སའི་ཁམས་ལ་མི་གནས་སོ། །ཆུའི་ཁམས་ལ་མ་ཡིན། མེའི་ཁམས་ལ་མ་ཡིན་ཏེ། རླུང་གི་ཁམས་ལ་ཡང་མི་གནས་སོ། །
en: Their absorption does not settle in the earth element, in the water element, in the fire element, or in the wind element.

source: འདོད་པའི་ཁམས་ལ་མི་གནས། གཟུགས་ཀྱི་ཁམས་ལ་མི་གནས། གཟུགས་མེད་པའི་ཁམས་ལ་མི་གནས།
en: It does not settle in the desire realm, in the form realm, or in the formless realm.

source: འཇིག་རྟེན་འདི་ལ་མི་གནས། འཇིག་རྟེན་ཕ་རོལ་ལ་མི་གནས་སོ། །
en: It is not settled in this world or in the world beyond.

source: མི་གནས་པའི་ཕྱིར་ཉམས་པ་མེད་དེ།
en: Since it does not settle, there is no deterioration.

source: དེ་བཞིན་གཤེགས་པ་སེམས་ཅན་ཐམས་ཅད་ཀྱང་ཏིང་ངེ་འཛིན་ཐོབ་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏེ།
en: The tathāgatas teach the Dharma so that all sentient beings may also attain absorption.

source: འདི་ནི་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པའི་འཕྲིན་ལས་ཉི་ཤུ་རྩ་བཞི་པའོ། །
en: This is the twenty-fourth tathāgata activity of the tathāgatas.

source: སངས་རྒྱས་རྟག་ཏུ་མཉམ་པར་གཞག །
en: “ ‘The buddhas are constantly in equipoise.

source: དེ་ཡི་ཏིང་འཛིན་ཉམས་པ་མེད། །
en: Their absorption does not deteriorate.

source: ཆོས་རྣམས་ཀུན་དང་མཉམ་པར་ལྡན། །
en: The equality of all phenomena.

source: སངས་རྒྱས་མཉམ་ཉིད་མཉམ་པར་གཞག །
en: The buddhas are settled evenly in equality,

source: ས་ཆུ་མེ་ལ་མ་ཡིན་ཏེ། །རླུང་དང་འདོད་གཟུགས་གཟུགས་མེད་ལ། །རྒྱལ་བ་གནས་ཏེ་བསམ་གཏན་མིན། །
en: In the earth, water, fire, or air element, Or in the realms of desire, form, or formlessness. “ ‘The concentration of the victors is not settled

source: དེས་འདི་ཏིང་འཛིན་ཉམས་པ་མེད། །
en: Therefore, their absorption is without deterioration.’

source: རིགས་ཀྱི་བུ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པའི་ཤེས་རབ་ཉམས་པ་མེད་དོ། །
en: (25) “Furthermore, son of noble family, the insight of the tathāgatas is without deterioration.

source: ཤེས་རབ་གང་ཞེ་ན།
en: What kind of insight is it?

source: གང་ཆོས་ཐམས་ཅད་རབ་ཏུ་ཤེས་པ་སྟེ། གཞན་གྱི་དྲིང་མི་འཇོག་པའི་ཤེས་པའོ། །
en: It is a thorough knowledge of all phenomena, a knowledge that does not depend on anything else.

source: སེམས་ཅན་གཞན་དག་དང་། གང་ཟག་གཞན་རྣམས་ལ་ཆོས་ཡང་དག་པར་སྟོན་པའི་ཤེས་པའོ། །
en: They know how to teach the Dharma correctly to other beings and individuals.

source: སོ་སོ་ཡང་དག་པར་རིག་པ་ལ་མཁས་པས་ཚིག་རབ་ཏུ་དབྱེ་བ་ཤེས་པའོ། །
en: They are skilled in correct discrimination and know how to analyze words.

source: ཚིག་གཅིག་ལ་འཇུག་པས་བསྐལ་པ་བརྒྱ་སྟོང་དུ་གནས་ཤིང་སྟོན་པ་ཤེས་པའོ། །
en: They know how to teach so that the usage of a single word will prevail for a hundred thousand eons.

source: ཇི་ལྟར་དྲིས་པ་བཞིན་དུ་ཐེ་ཚོམ་གཅོད་པའི་ཤེས་པའོ། །
en: They know how to eradicate doubts in accordance with the manner of the question.

source: ཐམས་ཅད་དུ་ཆགས་པ་མེད་པ་ཤེས་པའོ། །
en: They know how to be totally without attachment.

source: ཐེག་པ་གསུམ་རྣམ་པར་དགོད་པ་བསྟན་པ་ཤེས་པའོ། །
en: They know how to teach the arrangement of the three vehicles.

source: སེམས་ཅན་གྱི་སེམས་ཀྱི་སྤྱོད་པ་བརྒྱད་ཁྲི་བཞི་སྟོང་ཡོངས་སུ་ཤེས་པའི་ཤེས་པའོ། །
en: They know entirely the eighty-four thousand types of mental conduct of beings.

source: ཆོས་ཀྱི་ཕུང་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་སོ་སོ་ཅི་རིགས་པར་ཆོས་སྟོན་པ་ཤེས་པའོ། །
en: They know how to teach the eighty-four thousand divisions of Dharma, each as is appropriate.

source: འདི་ནི་དེ་བཞིན་གཤེགས་པའི་ཤེས་རབ་མཐའ་ཡས་པ། ཐུག་པ་མེད་པ། ཟད་པ་མེད་པ། ཚད་མེད་པ་བསྟན་པའོ། །
en: In this way, the insight of the tathāgatas has been shown to be limitless, infinite, inexhaustible, and immeasurable.

source: ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་ལ་ཉམས་པ་མེད་ཅིང་ཡོངས་སུ་ཉམས་པ་མེད་པ་དེ་ལྟར་སེམས་ཅན་ཐམས་ཅད་ཀྱང་ཤེས་རབ་མི་ཟད་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏེ།
en: “Just as the tathāgatas are without deterioration and thoroughly without deterioration, so they teach the Dharma so that the insight of all sentient beings will be inexhaustible.

source: འདི་ནི་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པའི་འཕྲིན་ལས་ཉི་ཤུ་རྩ་ལྔ་པའོ། །
en: This is the twenty-fifth tathāgata activity of the tathāgatas.

source: ཤེས་རབ་ཀྱིས་ནི་ཚུལ་རྣམས་མངོན་སུམ་སྟེ། །
en: “ ‘With insight that perceives all aspects directly,

source: སོ་སོ་ཡང་དག་རིག་དབང་ཕ་རོལ་སོན། །
en: The masters of correct discrimination have gone beyond.

source: བསམ་བཞིན་རང་བྱུང་སེམས་ཅན་ཆོས་སྟོན་ཏེ། །
en: They teach the Dharma to beings, naturally responding to their thinking.

source: འབྲུ་གཅིག་ཚིག་ལ་མཐའ་ཡས་ཚིག་རྣམས་འཇུག །
en: In a single syllable or word, limitless words are contained.

source: འགྲོ་བའི་སྤྱོད་པ་ཐུག་མེད་རབ་ཤེས་ནས། །
en: “ ‘Aware of the infinite conduct of beings,

source: དེ་བཞིན་བརྒྱད་ཁྲི་བཞི་སྟོང་ཆོས་སྟོན་ཀྱང་། །
en: They teach the eighty-four thousand Dharmas accordingly.

source: ནམ་ཡང་བདེ་གཤེགས་ཤེས་རབ་ཉམས་མེད་དེ། །
en: The insight of the sugatas never deteriorates.

source: སྟོབས་བཅུའི་ལས་འདི་འགྲོ་ལས་ཁྱད་པར་འཕགས། །
en: This activity of the ten strengths sets them apart from other beings.’

source: རིགས་ཀྱི་བུ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་གྲོལ་བ་ཉམས་པ་མེད་དོ། །
en: (26) “Son of noble family, the liberation of the tathāgatas is without deterioration.

source: དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་གྲོལ་བ་གང་ཞེ་ན།
en: What is the liberation of the tathāgatas?
